#include <iostream>

using namespace std;

// Создать класс "Дробь" для представления простой дроби
// Поля:
// - числитель
// - знаменатель
// Функции-члены:
// - конструктор принимающий числитель и знаменатель
// - конструктор по умолчанию
// - вывод дроби на экран
// - сложение, вычитание, умножение простой дроби с простой дробью
// - сложение, вычитание, умножение простой дроби с целым числом
// В арифметических операциях предусмотреть вызов операций по цепочке (this)
// Предусмотреть сокращение дроби (конструктор)

int main()
{
    setlocale(LC_ALL, "");

    

    return 0;
}
