#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "");
	
	cout << "        Мой флот                          Вражеский флот    " << endl;
	cout << "    А Б В Г Д Е Ж З И К                А Б В Г Д Е Ж З И К  " << endl;
	cout << "    ___________________                ___________________  " << endl;
	cout << " 1 |* * * * * * * * * *|            1 |* * * * * * * * * *| " << endl;
	cout << " 2 |* * * * * * * * * *|            2 |* * * * * * * * * *| " << endl;
	cout << " 3 |* * * * * * * * * *|            3 |* * * * * * * * * *| " << endl;
	cout << " 4 |* * * * * * * * * *|            4 |* * * * * * * * * *| " << endl;
	cout << " 5 |* * * * * * * * * *|            5 |* * * * * * * * * *| " << endl;
	cout << " 6 |* * * * * * * * * *|            6 |* * * * * * * * * *| " << endl;
	cout << " 7 |* * * * * * * * * *|            7 |* * * * * * * * * *| " << endl;
	cout << " 8 |* * * * * * * * * *|            8 |* * * * * * * * * *| " << endl;
	cout << " 9 |* * * * * * * * * *|            9 |* * * * * * * * * *| " << endl;
	cout << "10 |* * * * * * * * * *|           10 |* * * * * * * * * *| " << endl;
	cout << "    -------------------                -------------------  " << endl;

	return 0;
}


