#include <iostream>
#include <vector>

using namespace std;

int main()
{
    setlocale(LC_ALL, "");

#pragma region vector

    cout << "==============================vector==============================" << endl;
    // создаём вектор
    vector<int> vec;

    cout << "Ёмкость вектора: " << vec.capacity() << endl;
    cout << "____________________________________________________________" << endl;
    cout << "Количество элементов вектора: " << vec.size() << endl;
    cout << "____________________________________________________________" << endl;
    cout << "Изменяем размер вектора..." << endl;
    vec.resize(4, 0);
    cout << "____________________________________________________________" << endl;
    cout << "Количество элементов вектора: " << vec.size() << endl;
    cout << "____________________________________________________________" << endl;
    cout << "Элементы вектора: " << endl;
    for (size_t i = 0; i < vec.size(); i++)
    {
        cout << i+1 << "-й элемент вектора = " << vec[i] << endl;
    }
    cout << "____________________________________________________________" << endl;
    cout << "Максимальный размер вектора: " << vec.max_size() << " Байт" << endl;
    cout << "____________________________________________________________" << endl;
    cout << "Максимальный размер вектора: " << vec.max_size()/4 << endl;
    cout << "____________________________________________________________" << endl;
    cout << "Вставляем элемент в конец вектора..." << endl;
    vec.push_back(1);
    cout << "____________________________________________________________" << endl;
    for (size_t i = 0; i < vec.size(); i++)
    {
        cout << i + 1 << "-й элемент вектора = " << vec[i] << endl;
    }
    cout << "____________________________________________________________" << endl;
    cout << "Создаём обычный итератор и выставляем его в начало вектора..." << endl;
    vector<int>::iterator i_iter;
    cout << "Выводим содержимое вектора с помощью итератора:" << endl;
    for (i_iter = vec.begin(); i_iter != vec.end(); i_iter++)
    {
        cout << *(i_iter) << endl;
    }
    cout << "____________________________________________________________" << endl;
    cout << "Создаём реверсный итератор и выставляем его в конец вектора..." << endl;
    vector<int>::reverse_iterator r_iter;
    cout << "Выводим содержимое вектора с помощью итератора:" << endl;
    for (r_iter = vec.rbegin(); r_iter != vec.rend(); r_iter++)
    {
        cout << *(r_iter) << endl;
    }
    cout << "____________________________________________________________" << endl;
    cout << "Добавляем два элемента перед последним элементом вектора..." << endl;
    vec.insert(i_iter - 1, 2, 3);
    for (size_t i = 0; i < vec.size(); i++)
    {
        cout << i + 1 << "-й элемент вектора = " << vec[i] << endl;
    }
#pragma endregion

#pragma region list

    //cout << endl << endl;
    //cout << "==============================list==============================" << endl;


#pragma endregion

    return 0;
}
